backend/models/Clientes.php

    public function retornaCliente($cnpj)
    {
    	$query = self::find()
    	->where(['dono' => Yii::$app->user->identity['cnpj']])
    	->andWhere(['cnpj' => $cnpj])
    	->one();
---
SELECT * FROM `clientes` WHERE (`dono`='11095658000140') AND (`cnpj`='11095658000140')