backend/models/Mensagens.php

    public function verificaNovas()
    {
    	$novas = self::find()
    	->where(['status' => 0])
    	->andWhere(['>', 'databaixa', date('Y-m-d')])
    	->andWhere(['in', 'para', [$this->para,'TODOS']])
    	->count();
---
SELECT COUNT(*) FROM `mensagens` WHERE ((`status`=0) AND (`databaixa` > '2016-07-14')) AND (`para` IN ('11095658000140', 'TODOS'))

    public function listarNovas()
    {
		$novas = self::find()
		->where(['status' => 0])
    	->andWhere(['>', 'databaixa', date('Y-m-d')])
    	->andWhere(['in', 'para', [$this->para,'TODOS']])
    	->limit(self::verificaNovas())
    	->all();
---
SELECT * FROM `mensagens` WHERE ((`status`=0) AND (`databaixa` > '2016-07-14')) AND (`para` IN ('11095658000140', 'TODOS')) LIMIT 3