backend/models/Minutas.php

SELECT `nome` FROM `clientes` WHERE `cnpj`='09835783624'
---
    public function stringDataGrid($tipo = 'cliente', $parametros)
    {
    	if ($parametros['cnpj'] == '') {
    		return '---';
    	}

    	$model = new Clientes();
    	$cliente = $model->find()
    	->select(['nome'])
    	->where(['cnpj' => $parametros['cnpj']])
    	->one();