backend/models/Tabelas.php

    public function nomeTabela($id)
    {
    	return self::findOne($id);
---
SELECT * FROM `tabelas` WHERE `id`='1'