backend/models/Usuarios.php

SELECT * FROM `usuarios` WHERE `id`=1
---
	public static function findIdentity($id) {
		return self::findOne($id);

SELECT * FROM `usuarios` WHERE `login`='3d65fd70d95a4edfe9555d0ebeca2b17'
---
	public static function findByUsername($username) {
		return self::findOne(['login'=>md5($username)]);